In [2]:
# =[Préliminaires]==========================
# Usage de SQL magic commands avec ipython.

# Chargement de l'environnement informatique interactif ipython:
%load_ext sql

# Connection à la base de donnée mysql en tant que utilisateur
# 'kodascii' sur un 'localhost' avec pour mot de passe 'pass123':
%sql mysql://kodascii:pass123@localhost/

In [3]:
# Marque floody_1 comme base de donnée de travail:
%sql USE `playground`;

 * mysql://kodascii:***@localhost/
0 rows affected.

[]

In [3]:
%%sql
CREATE TABLE employees (
    emp_id INT PRIMARY KEY,
    emp_name VARCHAR(255),
    dept_id INT
);

CREATE TABLE departments (
    dept_id INT PRIMARY KEY,
    dept_name VARCHAR(255)
);

-- Insert sample data
INSERT INTO employees VALUES (1, 'John Doe', 101);
INSERT INTO employees VALUES (2, 'Jane Smith', 102);
INSERT INTO employees VALUES (3, 'Bob Johnson', 101);

INSERT INTO departments VALUES (101, 'HR');
INSERT INTO departments VALUES (102, 'IT');

 * mysql://kodascii:***@localhost/
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql
SELECT *
FROM employees
INNER JOIN departments ON employees.dept_id = departments.dept_id;

 * mysql://kodascii:***@localhost/
3 rows affected.

[(1, 'John Doe', 101, 101, 'HR'),
 (2, 'Jane Smith', 102, 102, 'IT'),
 (3, 'Bob Johnson', 101, 101, 'HR')]

In [8]:
%%sql
SELECT *
FROM employees
LEFT JOIN departments ON employees.dept_id = departments.dept_id;

 * mysql://kodascii:***@localhost/
3 rows affected.

[(1, 'John Doe', 101, 101, 'HR'),
 (2, 'Jane Smith', 102, 102, 'IT'),
 (3, 'Bob Johnson', 101, 101, 'HR')]

In [9]:
%%sql
SELECT *
FROM employees
RIGHT JOIN departments ON employees.dept_id = departments.dept_id;

 * mysql://kodascii:***@localhost/
3 rows affected.

[(1, 'John Doe', 101, 101, 'HR'),
 (2, 'Jane Smith', 102, 102, 'IT'),
 (3, 'Bob Johnson', 101, 101, 'HR')]

In [13]:
%%sql
SELECT *
FROM employees
JOIN departments ON employees.dept_id = departments.dept_id;

 * mysql://kodascii:***@localhost/
3 rows affected.

[(1, 'John Doe', 101, 101, 'HR'),
 (2, 'Jane Smith', 102, 102, 'IT'),
 (3, 'Bob Johnson', 101, 101, 'HR')]

# Différences entre les jointures

In [4]:
%%sql
CREATE TABLE students (
    student_id INT PRIMARY KEY,
    student_name VARCHAR(255)
);

CREATE TABLE courses (
    course_id INT PRIMARY KEY,
    course_name VARCHAR(255)
);

CREATE TABLE enrollments (
    enrollment_id INT PRIMARY KEY,
    student_id INT,
    course_id INT,
    FOREIGN KEY (student_id) REFERENCES students(student_id),
    FOREIGN KEY (course_id) REFERENCES courses(course_id)
);

-- Sample Data
INSERT INTO students VALUES (1, 'John Doe');
INSERT INTO students VALUES (2, 'Jane Smith');

INSERT INTO courses VALUES (101, 'Mathematics');
INSERT INTO courses VALUES (102, 'History');

INSERT INTO enrollments VALUES (1001, 1, 101);
INSERT INTO enrollments VALUES (1002, 1, 102);
INSERT INTO enrollments VALUES (1003, 2, 101);

 * mysql://kodascii:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql
-- INNER JOIN example
SELECT students.student_id, students.student_name, enrollments.enrollment_id, courses.course_name
FROM students
INNER JOIN enrollments ON students.student_id = enrollments.student_id
INNER JOIN courses ON enrollments.course_id = courses.course_id;

 * mysql://kodascii:***@localhost/
3 rows affected.

[(1, 'John Doe', 1001, 'Mathematics'),
 (1, 'John Doe', 1002, 'History'),
 (2, 'Jane Smith', 1003, 'Mathematics')]

In [6]:
%%sql
-- LEFT JOIN example
SELECT students.student_id, students.student_name, enrollments.enrollment_id, courses.course_name
FROM students
LEFT JOIN enrollments ON students.student_id = enrollments.student_id
LEFT JOIN courses ON enrollments.course_id = courses.course_id;

 * mysql://kodascii:***@localhost/
3 rows affected.

[(1, 'John Doe', 1001, 'Mathematics'),
 (1, 'John Doe', 1002, 'History'),
 (2, 'Jane Smith', 1003, 'Mathematics')]

In [7]:
%%sql
-- RIGHT JOIN example
SELECT students.student_id, students.student_name, enrollments.enrollment_id, courses.course_name
FROM students
RIGHT JOIN enrollments ON students.student_id = enrollments.student_id
RIGHT JOIN courses ON enrollments.course_id = courses.course_id;

 * mysql://kodascii:***@localhost/
3 rows affected.

[(1, 'John Doe', 1001, 'Mathematics'),
 (2, 'Jane Smith', 1003, 'Mathematics'),
 (1, 'John Doe', 1002, 'History')]